greenhouse-sims/vel15/system/arc
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

fields  ( p mag(U) nuTilda U );

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type sets;
libs            ("libsampling.so");
writeControl    writeTime;

sets
(
     wall
     {
        type        arcUniform;
        centre      (0.0 0 0.0);
        normal      (0 1 0);
        radial      (1.0 0 0.0);
        startAngle  0.0;
        endAngle    -3.141592653589793; 
        nPoints     200;
        axis        xyz;
    }
);

// ************************************************************************* //
